# Handling missing value #2

In [25]:
import pandas as pd

In [26]:
df = pd.read_csv("Fortune_10.csv")

In [27]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [28]:
#Let us Find out how many null values and how many missing values are present in our data set

In [29]:
df.isnull()   #this will find out whether there is a null value or not

      ID   Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  False  False     False      False    False     False   False   False
1  False  False     False      False    False     False   False   False
2  False  False     False      False    False     False   False   False
3  False  False     False      False    False     False   False   False
4  False  False     False      False    False     False   False   False
5  False  False     False      False    False     False   False   False
6  False  False     False      False    False     False   False   False
7  False  False     False      False    False     False   False   False
8  False  False     False      False    False      True   False   False
9  False  False     False      False    False     False   False   False

In [30]:
#look at the above output it is showing false everywher meaninng no null values
#but at one column that is Expense column it shows true which mean it has a null value

In [31]:
#now let us find out how many null values are present in a particular column

In [32]:
df.isnull().sum()   #  This method will tell the null values in every partiular column
                    #this is the most important methods and widely used across data analysis

ID           0
Name         0
Industry     0
Inception    0
Revenue      0
Expenses     1
Profit       0
Growth       0
dtype: int64

In [33]:
df.isnull().sum().sum()   #this method will give us the total null value count in the entire data set

1

In [34]:
df1 =  pd.read_csv("Fortune_10.csv")

In [35]:
df1

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [36]:
df1.notnull()    #opposite of isnull()   wherever there is missing value it will display false and wherever there is value 
                #it will display true meaning complete opposite of isnull()

     ID  Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  True  True      True       True     True      True    True    True
1  True  True      True       True     True      True    True    True
2  True  True      True       True     True      True    True    True
3  True  True      True       True     True      True    True    True
4  True  True      True       True     True      True    True    True
5  True  True      True       True     True      True    True    True
6  True  True      True       True     True      True    True    True
7  True  True      True       True     True      True    True    True
8  True  True      True       True     True     False    True    True
9  True  True      True       True     True      True    True    True

In [37]:
df1.notnull().sum()     #this will tell you the sum of every column and tells u about the correct values in each column

ID           10
Name         10
Industry     10
Inception    10
Revenue      10
Expenses      9
Profit       10
Growth       10
dtype: int64

In [38]:
df1.notnull().sum().sum()  #this lets you count the total number of correct values present in ther data set

79

In [39]:
#The same rule of isnull() and notnull() applies to the series as well

In [40]:
#lets create a series which is in common means single column

In [41]:
import numpy as np   #because we are using numpy to create a series

In [42]:
sr1 = pd.Series([1,2,3,np.nan,4,np.nan] )     #np.nan will bring us a null value
                                               #here note nan is derived from numpy

In [43]:
sr1

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [44]:
sr1.isnull()      #missing values represented by true

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [45]:
sr1.isnull().sum()   #gives you the total missing value in entire Data

2

In [46]:
sr1.notnull()  # opposite of isnull()

0     True
1     True
2     True
3    False
4     True
5    False
dtype: bool

In [47]:
sr1.notnull().sum()   #total count of correct values

4